[
    {
        "name": "Léa",
        "photo": "lea.jpg",
        "text": "Je m'appelle Léa, j'ai 17 ans et suis actuellement en classe de terminale. Je suis partie en Chine l'été dernier dans le but d'apprendre le chinois, pour cela je me suis rendue une semaine à Shanghai puis deux à Pékin. J'ai alors eu Lily pour professeur pendant la première semaine. Je me suis tout de suite sentie à l'aise et j'ai beaucoup apprécié qu'elle ait fait l'effort de parler français au maximum (à vrai dire mon anglais est très moyen).\n\nDurant cette semaine elle a su me transmettre l'équivalent de ce que j'aurais dû apprendre durant mon année de seconde au lycée (j'ai choisi le chinois en troisième langue). Je regrette de n'avoir pas pu rester plus longtemps pour apprendre d'avantage, car mon chinois reste limité. Cependant Lily m'a motivée à persévérer et je me suis inscrite cette année à l'institut Confucius de Strasbourg."
    },
    {
        "name": "Max",
        "photo": "max.jpg",
        "text": "Lily is a phenomenal teacher. She is thoughtful, engaging, caring, and fosters a very positive learning environment. There have been numerous times Lily has helped me outside of class, and she is always willing to go above and beyond. Simply put, if you want to learn Chinese, you will have a hard time finding a better teacher."
    },
    {
        "name": "Josmi",
        "photo": "josmi.jpg",
        "text": "Fang Yan (Lily) me enseñó caracteres chinos (Hanzi) durante tres meses en Shanghai, una experiencia de la que quedé tremendamente satisfecho. Siempre relajada y sonriente, llevaba la clase, que obviamente había preparado con todo detalle antes, con seguridad pero también con gran flexibilidad según hiciera falta, utilizando una variedad de medios y sacando siempre a relucir palabras y frases de mucho interés. Al hacer patente las relaciones que hay entre distintos caracteres y sus componentes, facilitaba entenderlos y, así, recordarlos con mucha más facilidad. Gracias a sus dotes de enseñanza debo decir que aprendí muchísimo con ella en ese tiempo."
    },
    {
        "name": "Seth",
        "photo": "seth.jpg",
        "text": "Lily (Fang Yan) is a wonderful teacher who always has a smile on her face, which makes learning with her a treat. She treats her students with dignity and respect, but is always up for a laugh and a good time in the class as well. What I like best about her teaching style is that she treats her students not as foreigners, but just as friends, so it feels a bit like we're just hanging out, which is a wonderful way to learn. She is always prepared for class, and obviously takes great pride in her work."
    },
    {
        "name": "Sophie",
        "photo": "sophie.jpg",
        "text": "Lily is an exceptionally skilled Hanyu and Hanzi teacher who manages to create a friendly and relaxed atmosphere in her fast-paced, practical and comprehensive classes. Lily's encouraging and cheerful attitude towards my attempts to pronounce recently learnt words or construct my own sentences gave me the confidence and guidance I needed to really develop my conversation skills to their full potential, which in turn strengthened the accuracy and scope of my written work.\n\nWith Lily as my teacher, my mandarin improved dramatically during my 5-week Mandarin intensive course in Shanghai, exceeding the expectations of my friends and teachers back home in Western Australia. I believe my time spent learning Mandarin with Lily is a key reason I have the ability and confidence to practice my Mandarin with native Mandarin speakers at my university and why I still continue to enjoy the study of Hanyu and Hanzi."
    },
    {
        "name": "Sian",
        "photo": "sian.jpg",
        "text": "I was Lily’s student for a month, and learnt a lot more than I thought I could in just four weeks!! She’s very patient, and would go over a subject as many times as was necessary for us to fully understand it. Her style of teaching meant that we were constantly practicing speaking the language in a constructive but challenging manner, and because of the variety of exercises (games, conversations, even songs!) I really enjoyed every moment!"
    },
    {
        "name": "Elisenda",
        "photo": "elisenda.jpg",
        "text": "He estat alumne de la Lily a Shanghai durant dos mesos, en un curs intensiu de 4 hores setmanals. Sabia que en dos mesos aprendria força xines, pero no m'esperava que n'aprendria tant, i es que la Lily es una molt bona professora que es preocupa perque l'estudiant aprengui, pacient i divertida amb la qual el temps passa volant i aprens sense practicament adonar-te'n. Moltes gracies Lily per aquest dos mesos!!"
    },
    {
        "name": "Candice",
        "photo": "candice.jpg",
        "text": "J'ai suivi les cours de mandarin de Lily pendant un mois a Shanghai. J'ai adoré apprendre le mandarin avec elle. Lily est une très bonne professeur. Tout d'abord, elle a toujours le sourire et c'est un point très important. Sa manière d'enseigner est très ludique. Je n'avais pas besoin de beaucoup travailler mon chinois en dehors des cours car grâce à sa méthode, on retient énormément de choses en classe. En effet, à chaque nouveau mot appris, je devais faire une phrase avec ce mot. J'ai beaucoup pratiqué en classe. On est toujours actif et c'est ce qui fait qu'on progresse rapidement. Mon niveau de mandarin s'est considérablement amélioré avec Lily. Outre son bon enseignement, Lily est drôle, gentille et très dévouée. Je garde un très bon souvenir de ses cours et j'aimerais pouvoir avec la chance de reprendre des cours de mandarin avec elle un jour."
    },
    {
        "name": "Maxime & Aurélie",
        "photo": "maxime-aurelie.jpg",
        "text": "Ma femme et moi-même avons commencé les cours avec Lily en Janvier 2013. Au cours des 30 premières heures de cours, nous avons développé les notions de base du chinois comme les sons, les phrases de tous les jours, les premières questions. Dans le même temps, nous avons appris les premiers caractères chinois. Grâce à l'enseignement de Lily, et sa patience, nous débrouiller en chinois en taxi, au restaurant, au supermarché ou dans les sites touristiques était devenu facile.\n\nLa 2e phase est d'apprendre les points de grammaire essentiels de la langue chinoise et de continuer de s’entraîner à parler, faire des dialogues, raconter une petite histoire etc. Les mots de vocabulaire suivent la méthode d'enseignement du HSK. Cela permet, si on le souhaite, de pratiquer afin de passer les examens du HSK. Au bout de 60 heures de travail, nous avons appris les 500 mots essentiels de la vie de tous les jours ainsi que les points essentiels pour dialoguer avec nos amis chinois.\n\nLily a un grand sens de l'écoute et grâce à une grande patience pour répéter et faire répéter les mots, nous a appris le chinois sans difficulté et toujours avec le sourire et beaucoup d'humour. Même si le chinois parait très compliqué, l'apprendre en rigolant est toujours plus efficace ! Lily est un super prof de chinois qui s'est adapté à nos difficultés et sera toujours là après les cours pour répondre à nos questions et nous soutenir dans notre apprentissage du chinois."
    },
    {
        "name": "Veronique",
        "photo": "veronique.jpg",
        "text": "Bonjour, Je suis arrivée de Bruxelles a Shanghai début octobre et j'ai décidé de suivre des cours de chinois intensifs à raison de 4 heures par jour dont 3 heures de conversation et 1 heure de caractères.\n\nMa prof s'appelle Lily et elle est vraiment super. Elle donne les cours en anglais mais pour mon plus grand bonheur elle parle également un peu le français ce qui est vraiment facile pour moi la petite belge. Ses cours sont variés car elle alterne vocabulaire, grammaire, chanson, jeux... Elle nous fournit également un support à l'aide de livres, cahiers d'exercices, dessins explicatifs.\n\nLily est une prof passionnée et c'est donc très agréable de suivre ses cours car elle nous fait découvrir la langue chinoise mais également la culture, les habitudes et nous raconte pleins d'anecdotes. Merci Lily pour ces 2 mois de cours intensifs, que du bonheur!"
    },
    {
        "name": "Frederique",
        "photo": "",
        "text": "Lily's class is very good. I would definitely recommend her. I could immediately use the things I learned during the classes in daily life. She is very practical. She amends the lessons in line with your wishes. Last, but not least, she is a very nice person!"
    },
    {
        "name": "Dominique",
        "photo": "dominique.jpg",
        "text": "Si vous avez décidé de vous lancer à l'aventure à Shanghai, c’est un bon choix car cette ville est le carrefour de l'Asi e: un passé historique, une richesse culturelle et de nombreux projets à venir... Si vous avez décidé d'apprendre le chinois comme moi à Shanghai, Lily vous accompagnera pas à pas, à votre rythme!\n\nAu delà de son professionalisme, sa pédagogie et sa patience sont réellement des atouts indispensables à l'apprentissage d'une langue étrangère aussi riche! En quelques semaines, j'ai pu être indépendante dans mon quotidien pour arriver à une maîtrise de la langue sur le plan professionnel. Lily est également un excellent guide dans l'apprentissage de la culture chinoise !"
    },
    {
        "name": "Rebecca",
        "photo": "rebecca.jpg",
        "text": "I've had a handful of Chinese teachers over the years and Lily's method of teaching is far supreme to anything I've experienced. She has a methodological, patient and natural teaching style that makes traversing the often bamboozling paths of Chinese logical, exciting and clear. She is professional, whilst at the same time has a warmth that makes you feel comfortable - I'm often a little shy trying to use my Chinese, but Lily makes you feel super at ease and confident. Her ability to break things down and answer even the most minor questions has seen me progress at a pace I'd never expected! I can't recommend Lily highly enough."
    },
    {
        "name": "Eddy",
        "photo": "eddy.jpg",
        "text": "I am a French guy, my job is \"Formative logistic for adult\". I studied Chinese ten months with Lily, she's a really effective teacher, and nice. With her advice I was very quickly able to manage and communicate with Chinese people. If you want to learn Chinese correctly, I advise you without hesitation Lily (lao shi) teacher."
    },
    {
        "name": "Anne",
        "photo": "anne.jpg",
        "text": "I enjoyed the class very much as it was both educational and fun at the same time. Within a month in Shanghai, I have learnt so much and learning mandarin was a breeze thanks to our teacher, Lily."
    },
    {
        "name": "Petko",
        "photo": "petko.jpg",
        "text": "Здравеите, Казвам се Петко и от съм от България. Пристигнах в Шанхай през Октомври 2013, и за мен беше повече от очевидно, че трябва да науча китайски колкото и трудно да изглежда това. Един колега ми каза за една една учителка, която била супер преподавател. Така че дори и не се замислих за секунда, и започнах първите уроци. Вече от 3 месеца вземам уроци с Lily, и просто е страхотно. Китайският е труден език, но с Lily е като игра! Това са повече от обикновени уроци по чужд език, това е културен обмен, това са понякога и даже и уроци по рисуване и пеене."
    },
    {
        "name": "Joseph",
        "photo": "joseph.jpg",
        "text": "I spent 3 weeks this past summer in Shanghai with the goal of improving my Mandarin. I had been studying Chinese for 5 years and consider my level \"decent\" but not great. I attended Hutong School where Fang Yan (房艳) was my instructor. From the first class, I was thrilled by how much I learned. She was always prepared, targeted her teaching to my level and provided the perfect balance of speaking and listening. I truly wish she would move to Chicago so I could continue studying with her. For anyone interested in starting or continuing their Mandarin studies, I heavily recommend Fang Yan (房艳) to be your instructor."
    },
    {
        "name": "Cori",
        "photo": "cori.jpg",
        "text": "Ho frequentato tre mesi di corso di cinese con Lily a Shanghai. Il mio obiettivo era quello, partendo da un cinese di livello elementare, di arricchire il mio vocabolario e riuscire ad intrattenere conversazioni semplici in modo fluido.\n\nE' stata un'esperienza utilissima grazie al fatto che Lily e' un' insegnante molto dinamica, lascia molto spazio alla conversazione, in cinese ovviamente, permettendo di mettere in pratica quanto studiato sui libri. Inoltre si e' sempre dimostrata disponibile a modificare il programma delle lezioni in base alle mie esigenze ed ai miei interessi.\n\nComplimenti anche per la creazione di un sito internet a disposizione di tutti gli studenti di cinese. E' un'ottima opportunita' per migliorare il proprio cinese in modo originale, partendo dai vocaboli e dalle espressioni piu' utili, quelle di uso quotidiano. Inoltre si puo' accedere a tantissimi contenuti interessanti come musica, foto, video in modo semplicissimo!"
    },
    {
        "name": "Frank",
        "photo": "frank.jpg",
        "text": "Ik vind Lily (Fang Yan) een fantastische en ervarend lerares. Lily legt alles goed in een duidelijke en doordachte manier uit. Haar lesmethodes zijn erg efficiënt, gunstig en zeer leuk.\n\nZe komt altijd goed voorbereid aan, en zorgt ook meteen voor een goede sfeer. Ik leerde elke les iets nieuws, wat ik daarna meteen ook kon toepassen in het dagelijks leven. Ze is erg flexibel en was bereid om een tijd af te spreken die gunstig voor mij was.\n\nLily concentreert erg op je uitspraak en op jouw gebruik van de vier chinese tonen, wat namelijk erg belangrijk is als je goed Mandarijns wilt gaan spreken. Wees ook niet bang om vragen te stellen als je bepaalde onderwerpen niet snapt, gewoon je vragen stellen en ze staat altijd voor je open om je vragen te beantwoorden. Lily geeft ook veel keuzevrijheid om wat voor onderwerpen je wilt gaan leren.\n\nZe is echt een leuk en aardig persoon om les van te krijgen en ik zou jullie haar allemaal willen aanbevelen!"
    },
    {
        "name": "Lea",
        "photo": "lea2.jpg",
        "text": "Lily war eine wundervolle Chinesischlehrerin. Mein Chinesisch hat sich während meiner Zeit als Lily’s Schuüerin wesentlich verbessert. Sie ist sehr geduldig, und konnte vorallem durch ihre Englisch und Franzoesischkentnisse, spezifische grammatikalische Konzepte sehr gut weitervermitteln.\n\nAber das beste an Lily war ihre Persönlichkeit – ich habe mich jeden Tag auf den Unterricht gefreut! Alles in allem kann ich Lily als Chinesischlehrerin wärmstens weiterempfehlen!"
    }
]
